erp3l/src/Catalogs/ПараметрыУчетаФИРСБУ/ПараметрыУчетаФИРСБУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПараметрыУчетаФИРСБУ</name>
  <attributes>
    <name>ВидФИ</name>
    <type>
      <types>EnumRef.ВидыФинансовыхИнструментов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФИ</name>
    <type>
      <types>DefinedType.ФинансовыйИнструмент</types>
    </type>
  </attributes>
  <attributes>
    <name>Актив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетаУчета</name>
    <attributes>
      <name>ВидСчетаФИ</name>
      <type>
        <types>CatalogRef.ВидыСчетовФИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

erp3l/src/Catalogs/ПараметрыУчетаФИРСБУ/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АктивОбязательство = Объект.Актив;
	
	ФинансовыеИнструментыФормы.ПриСозданииНаСервере_СчетаУчета(ЭтаФорма);
	
	КэшируемыеЗначения.Вставить("ИменаСубконто", 	ПолучитьИменаСубконто());
	КэшируемыеЗначения.Вставить("Организация", 		Справочники.Организации.ПустаяСсылка());
	КэшируемыеЗначения.Вставить("ВидыЦенныхБумаг", 	Перечисления.ВидыФинансовыхИнструментов.ПолучитьВидыЦенныхБумаг().ВыгрузитьЗначения());
	
	УправлениеФормой(ЭтаФорма);	
	
	Для каждого ТекущаяСтрока Из Объект.СчетаУчета Цикл
		МСФОКлиентСерверУХ.УстановитьДоступностьСубконто(ТекущаяСтрока.Счет, ТекущаяСтрока, КэшируемыеЗначения.ИменаСубконто);
		МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(ЭтаФорма, "Счет", ТекущаяСтрока, "СчетаУчета", Ложь);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура СчетаУчетаПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.СчетаУчета.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(ЭтаФорма, "Счет", ТекущаяСтрока, "СчетаУчета", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыУчетаДляПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ВидФИПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ФИПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура АктивПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииСчета(Элемент) Экспорт
	МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(ЭтаФорма, Элемент.Имя, ЭтаФорма);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект = Форма.Объект;	
	
	Если Форма.ПараметрыУчетаДля = 0 Тогда
		ЭтоЦБ = Форма.КэшируемыеЗначения.ВидыЦенныхБумаг.Найти(Объект.ВидФИ) <> Неопределено;
	Иначе	
		ЭтоЦБ = (ТипЗнч(Объект.ФИ) = Тип("СправочникСсылка.ЦенныеБумаги"));
	КонецЕсли;
		
	Элементы.ВидФИ.Видимость = Форма.ПараметрыУчетаДля = 0;
	Элементы.ФИ.Видимость = Форма.ПараметрыУчетаДля = 1;
	Элементы.АктивОбязательство.Видимость = ЭтоЦБ;
	
	ФинансовыеИнструментыФормыКлиентСервер.УправлениеФормой_СчетаУчета(Форма);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивОбязательствоПриИзменении(Элемент)
	Объект.Актив = (АктивОбязательство = 1);
КонецПроцедуры

&НаКлиенте
Процедура СчетаУчетаСчетПриИзменении(Элемент)
	ТекущаяСтрока = Объект.СчетаУчета.НайтиПоИдентификатору(Элементы.СчетаУчета.ТекущаяСтрока);
	МСФОКлиентСерверУХ.ОбновитьСубконтоСчета(ЭтаФорма, "Счет", ТекущаяСтрока, "СчетаУчета", Ложь);
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьИменаСубконто() Экспорт 

	Результат = Новый Структура;
	
	Субконто = Новый Соответствие;
	
	Субконто.Вставить(1, "Субконто1");
	Субконто.Вставить(2, "Субконто2");
	Субконто.Вставить(3, "Субконто3");
	
	Результат.Вставить("Счет", Субконто);	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
